{
  "1": {
    "name": "Olfactory Bulb",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Processes incoming odor signals before they reach cortical olfactory areas.",
    "aliases": [
      "OB",
      "Bulbus olfactorius"
    ],
    "functions": [
      "Performs initial synaptic processing for olfactory receptor neuron inputs.",
      "Sends refined odor information to limbic and cortical olfactory regions."
    ],
    "connections": [
      "Receives axons from olfactory receptor neurons via the olfactory nerve.",
      "Projects to the piriform cortex, amygdala, and entorhinal cortex."
    ]
  },
  "2": {
    "name": "Anterior Olfactory Nucleus",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Coordinates bilateral olfactory information and modulates odor perception.",
    "aliases": [
      "Anterior olfactory area"
    ],
    "functions": [
      "Integrates odor representations across hemispheres.",
      "Provides feedback modulation to the olfactory bulb."
    ],
    "connections": [
      "Maintains reciprocal connections with the olfactory bulb and piriform cortex.",
      "Links the two olfactory bulbs through anterior commissure fibers."
    ]
  },
  "3": {
    "name": "Piriform Cortex",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Primary olfactory cortex of the temporal lobe that supports odor identification and associative odor memory.",
    "aliases": [
      "Pyriform Cortex",
      "Primary Olfactory Cortex",
      "Area piriformis"
    ],
    "functions": [
      "Integrates olfactory bulb input into perceptual odor representations.",
      "Supports associative learning that links odors to context and reward."
    ],
    "connections": [
      "Receives dense afferents from the olfactory bulb and anterior olfactory nucleus.",
      "Projects to orbitofrontal cortex, amygdala, entorhinal cortex, and hypothalamic olfactory areas."
    ]
  },
  "4": {
    "name": "Frontal Agranular Insular Cortex",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Frontal extension of the insular cortex lacking granular layer IV that integrates gustatory, visceral, and affective cues.",
    "aliases": [
      "Frontal Agranular Insula",
      "Anterior Insular Cortex"
    ],
    "functions": [
      "Monitors internal bodily states relevant to taste, autonomic responses, and affect.",
      "Participates in salience detection and interoceptive awareness."
    ],
    "connections": [
      "Interconnects with orbitofrontal cortex, anterior cingulate cortex, and amygdala.",
      "Receives viscerosensory input via thalamic and brainstem relays."
    ]
  },
  "5": {
    "name": "Temporal Agranular Insular Cortex",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Temporal division of agranular insular cortex that links olfactory, gustatory, and limbic networks.",
    "aliases": [
      "Temporal Agranular Insula",
      "Posterior Insular Cortex"
    ],
    "functions": [
      "Integrates chemosensory information with visceral sensation.",
      "Supports emotional memory associated with taste and smell."
    ],
    "connections": [
      "Receives projections from piriform cortex and thalamic taste relays.",
      "Projects to amygdala, entorhinal cortex, and orbitofrontal regions."
    ]
  },
  "6": {
    "name": "Head of Caudate",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Anterior striatal sector involved in goal-directed action selection and cognitive aspects of motor control.",
    "aliases": [
      "Caudate Head",
      "Anterior Caudate Nucleus"
    ],
    "functions": [
      "Tracks action-outcome contingencies and supports executive planning.",
      "Participates in working memory and attention circuits with prefrontal cortex."
    ],
    "connections": [
      "Receives glutamatergic inputs from dorsolateral prefrontal and orbitofrontal cortices.",
      "Projects via striatopallidal pathways to globus pallidus and substantia nigra pars reticulata."
    ]
  },
  "7": {
    "name": "Body of Caudate",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Elongated middle portion of the caudate nucleus modulating cognitive-motor integration and eye movement control.",
    "aliases": [
      "Caudate Body",
      "Corpus Caudatum"
    ],
    "functions": [
      "Coordinates cortico-striatal loops for saccadic control and habit learning.",
      "Adjusts motor output based on feedback and motivational context."
    ],
    "connections": [
      "Receives afferents from association cortices and intralaminar thalamic nuclei.",
      "Projects to globus pallidus externus and substantia nigra pars reticulata."
    ]
  },
  "8": {
    "name": "Tail of Caudate",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Posterior tapering segment of the caudate nucleus linking striatal circuits with visual and limbic cortices.",
    "aliases": [
      "Caudate Tail"
    ],
    "functions": [
      "Supports visual attention, spatial learning, and reward prediction for peripheral stimuli.",
      "Participates in associative learning connecting visual cues with action outcomes."
    ],
    "connections": [
      "Receives projections from visual association cortex and superior colliculus.",
      "Sends outputs through striatonigral pathways to substantia nigra and pallidum."
    ]
  },
  "9": {
    "name": "Putamen",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Large dorsolateral striatal nucleus crucial for motor skill learning and sensorimotor integration.",
    "aliases": [
      "Putamen Nucleus",
      "Dorsolateral Striatum"
    ],
    "functions": [
      "Modulates execution of voluntary movements and habit formation.",
      "Integrates somatosensory, motor, and premotor cortical inputs for action selection."
    ],
    "connections": [
      "Receives dense corticostriatal projections from primary motor, premotor, and somatosensory cortices.",
      "Outputs via direct and indirect pathways to globus pallidus and substantia nigra."
    ]
  },
  "10": {
    "name": "Nucleus Accumbens",
    "keywords": [
      "Basal Ganglia",
      "Reward Circuit",
      "Striatum",
      "Ventral Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Key component of the ventral striatum involved in reward and motivation."
  },
  "11": {
    "name": "External Segment of Globus Pallidus",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Lateral pallidal segment that implements the indirect basal ganglia pathway to suppress competing motor programs.",
    "aliases": [
      "Globus Pallidus Externus",
      "GPe"
    ],
    "functions": [
      "Shapes movement by relaying inhibitory signals within the indirect basal ganglia circuit.",
      "Regulates rhythmic activity important for gait and posture."
    ],
    "connections": [
      "Receives GABAergic input from striatal medium spiny neurons of the indirect pathway.",
      "Projects to subthalamic nucleus, globus pallidus internus, and substantia nigra pars reticulata."
    ]
  },
  "12": {
    "name": "Internal Segment of Globus Pallidus",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Medial output nucleus of the basal ganglia that gates thalamocortical drive to premotor and motor areas.",
    "aliases": [
      "Globus Pallidus Internus",
      "GPi",
      "Medial Globus Pallidus"
    ],
    "functions": [
      "Provides tonic inhibitory control over motor thalamus to regulate movement initiation.",
      "Encodes movement parameters for learned motor sequences."
    ],
    "connections": [
      "Receives direct pathway input from striatum and excitatory drive from subthalamic nucleus.",
      "Projects via the ansa lenticularis and lenticular fasciculus to ventral anterior and ventrolateral thalamic nuclei."
    ]
  },
  "13": {
    "name": "Claustrum",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Thin subcortical sheet linking limbic, cognitive, and sensory areas, potentially coordinating cortical synchrony.",
    "aliases": [
      "Claustral Cortex",
      "Insular Claustrum"
    ],
    "functions": [
      "Facilitates multimodal integration and attention switching across cortical networks.",
      "Contributes to consciousness-related binding of sensory experiences."
    ],
    "connections": [
      "Receives reciprocal cortico-claustral projections from nearly all neocortical regions.",
      "Projects to limbic structures including amygdala and hippocampal formation."
    ]
  },
  "14": {
    "name": "Basal Forebrain",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Collection of cholinergic nuclei in the basal forebrain providing widespread neuromodulatory input to cortex and hippocampus.",
    "aliases": [
      "Basal Nucleus of Meynert",
      "Substantia Innominata"
    ],
    "functions": [
      "Supports attention, arousal, and learning through cortical acetylcholine release.",
      "Modulates hippocampal plasticity underlying memory encoding."
    ],
    "connections": [
      "Receives input from limbic structures such as amygdala and prefrontal cortex.",
      "Projects diffusely to neocortex, hippocampus, and amygdaloid complex."
    ]
  },
  "15": {
    "name": "Septal Nuclei",
    "keywords": [
      "Basal Ganglia",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Midline basal forebrain nuclei that coordinate hippocampal theta rhythm and reward-linked autonomic responses.",
    "aliases": [
      "Septal Area",
      "Septum Pellucidum Nuclei"
    ],
    "functions": [
      "Drive hippocampal oscillations important for memory and navigation.",
      "Integrate limbic inputs to regulate reward, motivation, and autonomic tone."
    ],
    "connections": [
      "Receive afferents from hippocampus, amygdala, and hypothalamus via the fornix.",
      "Project via the medial forebrain bundle and fornix to hippocampus and hypothalamus."
    ]
  },
  "16": {
    "name": "Amygdaloid Complex",
    "keywords": [
      "Amygdala",
      "Amygdaloid Complex",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Hub for processing emotional salience and associative memory."
  },
  "17": {
    "name": "Anterior Amygdaloid Area",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Rostral amygdalar subdivision interfacing olfactory, cortical, and basal forebrain inputs to shape emotional salience.",
    "aliases": [
      "Anterior Amygdaloid Area",
      "Periamygdaloid Cortex"
    ],
    "functions": [
      "Integrates olfactory cues with affective context for social and reproductive behaviors.",
      "Provides modulatory output to basal forebrain cholinergic neurons."
    ],
    "connections": [
      "Receives projections from olfactory bulb, piriform cortex, and hippocampal formation.",
      "Projects to medial amygdaloid nuclei, hypothalamus, and septal region."
    ]
  },
  "18": {
    "name": "Central Nuclear Group",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Amygdalar core comprising the central nucleus that orchestrates autonomic and behavioral expressions of emotion.",
    "aliases": [
      "Central Amygdaloid Nucleus",
      "Central Amygdala",
      "CeA"
    ],
    "functions": [
      "Coordinates defensive reactions and conditioned fear responses.",
      "Regulates autonomic output via projections to hypothalamic and brainstem centers."
    ],
    "connections": [
      "Receives convergent input from basolateral amygdala and brainstem sensory relays.",
      "Projects to hypothalamus, periaqueductal gray, parabrachial nucleus, and brainstem autonomic nuclei."
    ]
  },
  "19": {
    "name": "Lateral Nucleus",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Principal sensory gateway of the amygdala processing multimodal inputs relevant to emotional learning.",
    "aliases": [
      "Lateral Amygdaloid Nucleus",
      "LA"
    ],
    "functions": [
      "Encodes associative fear memories by integrating cortical and thalamic sensory signals.",
      "Supports evaluation of stimulus salience for emotional decision making."
    ],
    "connections": [
      "Receives auditory and visual inputs from sensory thalamus and temporal cortex.",
      "Projects to basolateral and central amygdalar nuclei for output to hypothalamic-brainstem effectors."
    ]
  },
  "20": {
    "name": "Basolateral Nucleus",
    "keywords": [
      "Amygdala",
      "Basolateral Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Part of the basolateral complex supporting emotional learning."
  },
  "21": {
    "name": "Basomedial Nucleus",
    "keywords": [
      "Amygdala",
      "Basolateral Amygdala",
      "Basomedial Amygdaloid Nucleus",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala",
      "Basolateral Complex"
    ],
    "description": "Transitional amygdalar nucleus linking olfactory and visceral information streams."
  },
  "22": {
    "name": "Anterior Cortical Nucleus",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Olfactory-related amygdalar cortex involved in odor-guided behaviors and autonomic regulation.",
    "aliases": [
      "Anterior Cortical Amygdaloid Nucleus"
    ],
    "functions": [
      "Links olfactory cues to reproductive and defensive behaviors.",
      "Modulates autonomic responses tied to odor perception."
    ],
    "connections": [
      "Receives afferents from olfactory bulb, piriform cortex, and lateral olfactory tract.",
      "Projects to medial amygdala, hypothalamic preoptic, and ventromedial nuclei."
    ]
  },
  "23": {
    "name": "Posterior Cortical Nucleus",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Posterior cortical amygdalar subdivision bridging olfactory and hippocampal circuits for contextual odor memory.",
    "aliases": [
      "Posterior Cortical Amygdaloid Nucleus"
    ],
    "functions": [
      "Supports contextual processing of olfactory cues and social odors.",
      "Interfaces with hippocampus for odor-guided spatial memory."
    ],
    "connections": [
      "Receives input from olfactory bulb, entorhinal cortex, and piriform cortex.",
      "Projects to hippocampal subiculum, medial amygdala, and hypothalamic targets."
    ]
  },
  "24": {
    "name": "Medial Nucleus",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Medial amygdaloid nucleus specialized for chemosensory processing and reproductive behaviors.",
    "aliases": [
      "Medial Amygdala",
      "MeA"
    ],
    "functions": [
      "Interprets pheromonal information to regulate social and mating behaviors.",
      "Influences hypothalamic autonomic and endocrine responses to olfactory cues."
    ],
    "connections": [
      "Receives accessory olfactory bulb and vomeronasal inputs via the stria terminalis.",
      "Projects to bed nucleus of the stria terminalis, hypothalamus, and brainstem autonomic centers."
    ]
  },
  "25": {
    "name": "Amygdalohippocampal Area",
    "keywords": [
      "Amygdala",
      "Amygdalohippocampal Transition Area",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Interface between amygdala and hippocampal formation."
  },
  "26": {
    "name": "Bed Nucleus of Stria Terminalis",
    "keywords": [
      "Amygdala",
      "Limbic System"
    ],
    "groups": [
      "Limbic System",
      "Amygdala"
    ],
    "description": "Extended amygdala structure mediating sustained fear, stress responses, and neuroendocrine regulation.",
    "aliases": [
      "BNST",
      "Bed Nucleus of the Terminal Stria"
    ],
    "functions": [
      "Integrates limbic information to modulate hypothalamic-pituitary-adrenal axis activity.",
      "Supports anxiety-related vigilance and social behavior modulation."
    ],
    "connections": [
      "Receives input from amygdala, hippocampus, and prefrontal cortex via stria terminalis.",
      "Projects to hypothalamus, brainstem autonomic nuclei, and ventral tegmental area."
    ]
  },
  "27": {
    "name": "Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Relay hub of the diencephalon that channels sensory, motor, and limbic information to the cerebral cortex.",
    "aliases": [
      "Thalamic Complex",
      "Dorsal Thalamus"
    ],
    "functions": [
      "Filters and routes ascending sensory signals to specific cortical targets.",
      "Participates in cortico-thalamo-cortical loops supporting attention, sleep, and consciousness."
    ],
    "connections": [
      "Receives inputs from spinal, brainstem, basal ganglia, and cerebellar pathways.",
      "Projects via thalamocortical radiations to virtually all cortical areas."
    ]
  },
  "28": {
    "name": "Anterior Nuclear Group of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Anterior thalamic nuclei cluster critical for memory and spatial navigation via Papez circuit.",
    "aliases": [
      "Anterior Thalamic Nuclei"
    ],
    "functions": [
      "Transmit hippocampal and mammillary body signals for episodic memory processing.",
      "Contribute to head-direction signaling and spatial orientation."
    ],
    "connections": [
      "Receive mammillothalamic tract input from mammillary bodies and hippocampal fornix fibers.",
      "Project to cingulate gyrus and retrosplenial cortex."
    ]
  },
  "29": {
    "name": "Lateral Dorsal Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Thalamic relay linking hippocampal circuits with cingulate cortex for visuospatial memory.",
    "aliases": [
      "Lateral Dorsal Thalamic Nucleus",
      "LD Nucleus"
    ],
    "functions": [
      "Supports visuospatial attention and memory consolidation.",
      "Integrates hippocampal and parietal inputs for navigation."
    ],
    "connections": [
      "Receives input from hippocampal subiculum and retrosplenial cortex.",
      "Projects predominantly to cingulate cortex and parietal association areas."
    ]
  },
  "30": {
    "name": "Mediodorsal Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Association thalamic nucleus connecting prefrontal cortex with limbic and basal ganglia networks.",
    "aliases": [
      "Mediodorsal Thalamic Nucleus",
      "MD Nucleus"
    ],
    "functions": [
      "Facilitates working memory, decision making, and reward-guided behavior.",
      "Integrates limbic signals into prefrontal executive circuits."
    ],
    "connections": [
      "Receives afferents from amygdala, basal ganglia, and olfactory cortex.",
      "Projects heavily to prefrontal cortex and anterior cingulate cortex."
    ]
  },
  "31": {
    "name": "Reuniens Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Midline thalamic nucleus coordinating hippocampal-prefrontal synchrony for memory consolidation.",
    "aliases": [
      "Nucleus Reuniens",
      "Thalamic Reuniens"
    ],
    "functions": [
      "Synchronizes hippocampal theta activity with medial prefrontal cortex during memory tasks.",
      "Supports retrieval and extinction of contextual fear memories."
    ],
    "connections": [
      "Receives hippocampal, amygdalar, and brainstem reticular inputs.",
      "Projects to medial prefrontal cortex, hippocampal CA1, and subiculum."
    ]
  },
  "32": {
    "name": "Posterolateral Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Posterolateral thalamic group relaying somatosensory and associative signals to parietal cortex.",
    "aliases": [
      "Pulvinar Posterior Nucleus",
      "Lateral Posterior Thalamic Nucleus"
    ],
    "functions": [
      "Mediates attention shifts and integration of visual-somatosensory information.",
      "Supports higher-order perceptual processing in parietal association cortex."
    ],
    "connections": [
      "Receives input from superior colliculus, visual cortex, and spinothalamic pathways.",
      "Projects to posterior parietal cortex and lateral occipital areas."
    ]
  },
  "33": {
    "name": "Pulvinar of Thalamus",
    "keywords": [
      "Diencephalon",
      "Pulvinar Nucleus",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Visual thalamic nucleus integrating attention and sensory signals."
  },
  "34": {
    "name": "Ventral Anterior Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Motor thalamic relay channeling basal ganglia output to premotor and supplementary motor areas.",
    "aliases": [
      "Ventral Anterior Thalamic Nucleus",
      "VA Nucleus"
    ],
    "functions": [
      "Facilitates planning and initiation of voluntary movements.",
      "Integrates cerebellar and basal ganglia signals for motor set maintenance."
    ],
    "connections": [
      "Receives input from globus pallidus internus and substantia nigra pars reticulata.",
      "Projects to premotor cortex, supplementary motor area, and frontal eye fields."
    ]
  },
  "35": {
    "name": "Ventral Lateral Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Motor relay nucleus that channels cerebellar and basal ganglia output to cortex.",
    "aliases": [
      "VL thalamus",
      "Ventrolateral thalamic nucleus"
    ],
    "functions": [
      "Supports voluntary movement planning and execution.",
      "Integrates cerebellar timing signals with basal ganglia output."
    ],
    "connections": [
      "Receives input from the dentate nucleus of the cerebellum.",
      "Receives basal ganglia projections from the globus pallidus internus.",
      "Projects to primary motor and premotor cortical areas."
    ]
  },
  "36": {
    "name": "Ventral Posterior Lateral Nucleus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Somatosensory relay conveying body tactile and proprioceptive information to primary somatosensory cortex.",
    "aliases": [
      "Ventral Posterolateral Nucleus",
      "VPL Thalamus"
    ],
    "functions": [
      "Transmits discriminative touch, vibration, and proprioception from trunk and limbs.",
      "Participates in pain and temperature processing via spinothalamic pathways."
    ],
    "connections": [
      "Receives lemniscal inputs from medial lemniscus and spinothalamic tract.",
      "Projects to postcentral gyrus and secondary somatosensory cortex."
    ]
  },
  "37": {
    "name": "Ventral Posterior Medial Nucleus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Thalamic relay for trigeminal somatosensory information targeting face representation in cortex.",
    "aliases": [
      "Ventral Posteromedial Nucleus",
      "VPM Thalamus"
    ],
    "functions": [
      "Conveys facial touch, taste, and nociceptive signals to the primary somatosensory cortex.",
      "Supports gustatory processing through its parvicellular subdivision."
    ],
    "connections": [
      "Receives trigeminothalamic and gustatory inputs from brainstem nuclei.",
      "Projects to face area of postcentral gyrus and insular gustatory cortex."
    ]
  },
  "38": {
    "name": "Dorsal Lateral Geniculate Nucleus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Primary visual thalamic relay transmitting retinal input to the visual cortex.",
    "aliases": [
      "Dorsal Lateral Geniculate Nucleus",
      "dLGN"
    ],
    "functions": [
      "Processes spatial and chromatic features for conscious vision.",
      "Maintains retinotopic maps and regulates visual attention via corticothalamic feedback."
    ],
    "connections": [
      "Receives retinal ganglion cell axons via the optic tract.",
      "Projects through optic radiations to primary visual cortex (V1)."
    ]
  },
  "39": {
    "name": "Medial Geniculate Nuclei",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Auditory thalamic nuclei relaying sound frequency and localization cues to auditory cortex.",
    "aliases": [
      "Medial Geniculate Body",
      "MGB"
    ],
    "functions": [
      "Transforms auditory brainstem inputs into cortical receptive field properties.",
      "Supports auditory attention and sound localization."
    ],
    "connections": [
      "Receives ascending inputs from inferior colliculus and auditory brainstem nuclei.",
      "Projects to primary and secondary auditory cortices in the temporal lobe."
    ]
  },
  "40": {
    "name": "Centromedian Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Intralaminar thalamic nucleus involved in arousal, nociception, and basal ganglia communication.",
    "aliases": [
      "Centromedian Thalamic Nucleus",
      "CM Nucleus"
    ],
    "functions": [
      "Modulates attention and sensorimotor gating within basal ganglia loops.",
      "Participates in pain processing and arousal regulation."
    ],
    "connections": [
      "Receives inputs from spinothalamic tract, reticular formation, and globus pallidus internus.",
      "Projects to striatum, supplementary motor area, and widespread cortex via intralaminar projections."
    ]
  },
  "41": {
    "name": "Parafascicular Nucleus of Thalamus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Intralaminar thalamic partner of the centromedian nucleus that influences associative learning and nociception.",
    "aliases": [
      "Parafascicular Thalamic Nucleus",
      "Pf Nucleus"
    ],
    "functions": [
      "Supports cognitive flexibility and action selection within basal ganglia circuits.",
      "Contributes to pain perception and autonomic responses."
    ],
    "connections": [
      "Receives inputs from spinoreticular and cerebellar pathways.",
      "Projects densely to striatal matrix and limbic cortex."
    ]
  },
  "42": {
    "name": "Habenular Nuclei",
    "keywords": [
      "Diencephalon",
      "Habenula",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Epithalamic relay shaping reward and aversion signaling."
  },
  "43": {
    "name": "Pineal Body",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Midline neuroendocrine gland that secretes melatonin to entrain circadian rhythms.",
    "aliases": [
      "Epiphysis Cerebri",
      "Pineal Gland"
    ],
    "functions": [
      "Synthesizes melatonin to regulate sleep-wake cycles and seasonal physiology.",
      "Modulates hypothalamic and pituitary hormone release."
    ],
    "connections": [
      "Receives sympathetic innervation via the superior cervical ganglion and paraventricular hypothalamus.",
      "Projects hormonal signals into cerebrospinal fluid and systemic circulation."
    ]
  },
  "44": {
    "name": "Zona Incerta",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Subthalamic gray zone participating in sensorimotor integration and arousal modulation.",
    "aliases": [
      "Zona Incerta Nucleus"
    ],
    "functions": [
      "Influences somatosensory processing, eye movements, and arousal state.",
      "Contributes to limbic-motor coordination for feeding and defensive behaviors."
    ],
    "connections": [
      "Receives inputs from motor cortex, cerebellum, and basal ganglia structures.",
      "Projects to thalamic nuclei, superior colliculus, spinal cord, and brainstem reticular formation."
    ]
  },
  "45": {
    "name": "Subthalamic Nucleus",
    "keywords": [
      "Diencephalon",
      "Thalamus"
    ],
    "groups": [
      "Diencephalon",
      "Thalamus"
    ],
    "description": "Lentiform subthalamic nucleus essential for indirect basal ganglia pathway control of movement.",
    "aliases": [
      "Luys' Body",
      "STN"
    ],
    "functions": [
      "Provides excitatory drive to globus pallidus internus to suppress unwanted movements.",
      "Participates in decision thresholds for action selection."
    ],
    "connections": [
      "Receives inhibitory input from globus pallidus externus and excitatory cortical afferents.",
      "Projects to globus pallidus internus, substantia nigra pars reticulata, and pedunculopontine nucleus."
    ]
  },
  "46": {
    "name": "Hypothalamus",
    "keywords": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "groups": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "description": "Controls autonomic, endocrine, and behavioral homeostasis."
  },
  "47": {
    "name": "Preoptic Region of Hypothalamus",
    "keywords": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "groups": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "description": "Anterior hypothalamic sector regulating reproductive behaviors, thermoregulation, and circadian rhythms.",
    "aliases": [
      "Preoptic Area",
      "Anterior Hypothalamus"
    ],
    "functions": [
      "Controls gonadotropin release and sexual behaviors via GnRH neurons.",
      "Monitors core temperature and initiates heat-loss mechanisms."
    ],
    "connections": [
      "Receives inputs from limbic forebrain, retina, and brainstem thermoregulatory centers.",
      "Projects to pituitary gland, autonomic brainstem nuclei, and other hypothalamic regions."
    ]
  },
  "48": {
    "name": "Supraoptic Region of Hypothalamus",
    "keywords": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "groups": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "description": "Hypothalamic division housing magnocellular neurons that release vasopressin and oxytocin.",
    "aliases": [
      "Supraoptic Hypothalamus",
      "Paraventricular-Supraoptic Complex"
    ],
    "functions": [
      "Regulates water balance through vasopressin secretion.",
      "Controls parturition and lactation via oxytocin release."
    ],
    "connections": [
      "Receives osmotic and cardiovascular sensory inputs from circumventricular organs and brainstem.",
      "Projects neurosecretory axons to posterior pituitary and parvocellular projections to autonomic centers."
    ]
  },
  "49": {
    "name": "Tuberal Region of Hypothalamus",
    "keywords": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "groups": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "description": "Mid-hypothalamic zone containing ventromedial and dorsomedial nuclei for energy balance and circadian rhythms.",
    "aliases": [
      "Tuberal Hypothalamus"
    ],
    "functions": [
      "Regulates feeding, metabolism, and satiety signaling.",
      "Coordinates circadian output via the suprachiasmatic nucleus connections."
    ],
    "connections": [
      "Receives inputs from arcuate nucleus, brainstem visceral centers, and limbic cortex.",
      "Projects to autonomic brainstem nuclei, pituitary, and widespread hypothalamic targets."
    ]
  },
  "50": {
    "name": "Mammillary Region of Hypothalamus",
    "keywords": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "groups": [
      "Diencephalon",
      "Hypothalamus"
    ],
    "description": "Posterior hypothalamic region centered on mammillary bodies that supports memory and spatial navigation.",
    "aliases": [
      "Mammillary Hypothalamus"
    ],
    "functions": [
      "Participates in recollective memory through the Papez circuit.",
      "Integrates vestibular and head-direction signals for navigation."
    ],
    "connections": [
      "Receives hippocampal inputs via the fornix.",
      "Projects through the mammillothalamic and mammillotegmental tracts to thalamus and midbrain."
    ]
  },
  "51": {
    "name": "White Matter of Forebrain",
    "keywords": [
      "Forebrain",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "Major myelinated fiber systems of the forebrain enabling long-range communication between cortical and subcortical regions.",
    "aliases": [
      "Forebrain White Matter"
    ],
    "functions": [
      "Supports efficient transmission of sensory, motor, and associative information across hemispheres and lobes.",
      "Provides structural scaffolding for cortico-cortical and cortico-subcortical loops."
    ],
    "connections": [
      "Includes commissural tracts, association fibers, and projection pathways.",
      "Links cortical areas with thalamus, basal ganglia, hippocampus, and brainstem."
    ]
  },
  "52": {
    "name": "Anterior Commissure",
    "keywords": [
      "Anterior Commissural Tract",
      "Forebrain",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "Compact commissural tract connecting temporal lobes and olfactory structures across hemispheres.",
    "aliases": [
      "Anterior Commissural Tract"
    ],
    "functions": [
      "Balances bilateral olfactory processing and temporal lobe communication.",
      "Provides alternate interhemispheric route for pain and auditory information."
    ],
    "connections": [
      "Interconnects anterior temporal cortices, amygdalae, and olfactory bulbs.",
      "Links orbitofrontal and inferior frontal regions across the midline."
    ]
  },
  "53": {
    "name": "Corpus Callosum",
    "keywords": [
      "Callosal Fibers",
      "Forebrain",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "Largest cerebral commissure enabling integration of sensory, motor, and cognitive functions between hemispheres.",
    "aliases": [
      "Corpus Callosum Tract"
    ],
    "functions": [
      "Coordinates bilateral cortical processing for language, vision, and motor control.",
      "Facilitates interhemispheric transfer of learning and memory representations."
    ],
    "connections": [
      "Contains callosal fibers linking homologous neocortical areas across frontal, parietal, temporal, and occipital lobes.",
      "Connects cingulate cortices via the forceps minor and major."
    ]
  },
  "54": {
    "name": "Fornix",
    "keywords": [
      "Forebrain",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "C-shaped fiber bundle connecting hippocampus to mammillary bodies and septal area.",
    "aliases": [
      "Fornical Tract"
    ],
    "functions": [
      "Supports memory consolidation and retrieval within the Papez circuit.",
      "Transmits hippocampal signals controlling hypothalamic autonomic responses."
    ],
    "connections": [
      "Arises from hippocampal fimbria and subiculum.",
      "Projects to mammillary bodies, septal nuclei, and anterior thalamic nuclei."
    ]
  },
  "55": {
    "name": "Mammillothalamic Tract",
    "keywords": [
      "Forebrain",
      "Vicq d’Azyr Bundle",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "White matter tract linking mammillary bodies to anterior thalamic nuclei within the Papez circuit.",
    "aliases": [
      "Vicq d'Azyr Bundle"
    ],
    "functions": [
      "Conveys mnemonic information from hypothalamus to thalamus for cingulate processing.",
      "Supports spatial orientation and episodic memory."
    ],
    "connections": [
      "Originates in mammillary bodies of the hypothalamus.",
      "Terminates in anterior thalamic nuclei projecting to cingulate cortex."
    ]
  },
  "56": {
    "name": "Optic Tract",
    "keywords": [
      "Forebrain",
      "Optic Nerve Continuation",
      "Visual Pathway",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain"
    ],
    "description": "Axonal continuation of the optic nerve carrying retinal signals to thalamic and midbrain visual centers.",
    "aliases": [
      "Optic Pathway"
    ],
    "functions": [
      "Relays visual information for conscious perception, reflexes, and circadian entrainment.",
      "Supports pupillary light reflex via pretectal projections."
    ],
    "connections": [
      "Receives input from retinal ganglion cell axons after optic chiasm.",
      "Projects to lateral geniculate nucleus, superior colliculus, pretectum, and suprachiasmatic nucleus."
    ]
  },
  "57": {
    "name": "Anterior Horn of Lateral Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Frontal extension of the lateral ventricle that cushions frontal lobe structures with cerebrospinal fluid.",
    "aliases": [
      "Frontal Horn of Lateral Ventricle"
    ],
    "functions": [
      "Provides CSF circulation and homeostasis for frontal cerebral tissues.",
      "Acts as anatomical landmark during neurosurgical navigation."
    ],
    "connections": [
      "Continuous with the ventricular body at the foramen of Monro.",
      "Communicates CSF flow with third ventricle via interventricular foramen."
    ]
  },
  "58": {
    "name": "Body of Lateral Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Central segment of the lateral ventricle running through parietal lobe white matter.",
    "aliases": [
      "Body of the Lateral Ventricle"
    ],
    "functions": [
      "Maintains cerebrospinal fluid reservoir for parietal and callosal structures.",
      "Supports nutrient exchange and waste clearance through ependymal lining."
    ],
    "connections": [
      "Connects anterior and posterior horns of the lateral ventricle.",
      "Communicates with choroid plexus for CSF production."
    ]
  },
  "59": {
    "name": "Posterior Horn of Lateral Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Occipital recess of the lateral ventricle extending into the occipital lobe.",
    "aliases": [
      "Occipital Horn of Lateral Ventricle"
    ],
    "functions": [
      "Provides CSF support to visual association cortex.",
      "Serves as radiologic landmark for optic radiations."
    ],
    "connections": [
      "Continuous with ventricular atrium near the splenium of the corpus callosum.",
      "Contains choroid plexus continuation into the temporal horn."
    ]
  },
  "60": {
    "name": "Inferior Horn of Lateral Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Temporal extension of the lateral ventricle adjacent to hippocampus and amygdala.",
    "aliases": [
      "Temporal Horn of Lateral Ventricle"
    ],
    "functions": [
      "Supports CSF circulation near hippocampal formation.",
      "Provides surgical corridor for medial temporal lobe procedures."
    ],
    "connections": [
      "Extends from ventricular atrium alongside hippocampal head and tail.",
      "Contains choroid plexus and collateral eminence landmarks."
    ]
  },
  "61": {
    "name": "Third Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Midline ventricular cavity of the diencephalon connecting lateral and fourth ventricles.",
    "aliases": [
      "Ventriculus Tertius"
    ],
    "functions": [
      "Ensures cerebrospinal fluid circulation between forebrain and brainstem.",
      "Provides ependymal interface for hypothalamic hormone diffusion."
    ],
    "connections": [
      "Receives CSF from lateral ventricles via foramina of Monro.",
      "Drains into cerebral aqueduct leading to fourth ventricle."
    ]
  },
  "62": {
    "name": "Cerebellar Vermis",
    "keywords": [
      "Cerebellum",
      "Hindbrain"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Midline cerebellar structure coordinating axial posture."
  },
  "63": {
    "name": "Cerebellar Deep Nuclei",
    "keywords": [
      "Cerebellum",
      "Dentate Nucleus",
      "Fastigial Nucleus",
      "Hindbrain",
      "Interposed Nuclei"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Deep cerebellar nuclei that serve as primary output channels from cerebellar cortex.",
    "aliases": [
      "Dentate-Interposed-Fastigial Nuclei"
    ],
    "functions": [
      "Transform cerebellar cortical computations into motor and cognitive commands.",
      "Contribute to balance, eye movements, and limb coordination."
    ],
    "connections": [
      "Receive inhibitory Purkinje cell projections from cerebellar cortex.",
      "Project via superior cerebellar peduncle to red nucleus, thalamus, and vestibular nuclei."
    ]
  },
  "64": {
    "name": "White Matter of Hindbrain",
    "keywords": [],
    "groups": [],
    "description": "Myelinated fiber tracts of the hindbrain conveying sensory, motor, and autonomic information.",
    "aliases": [
      "Hindbrain White Matter"
    ],
    "functions": [
      "Provide conduits between spinal cord, cerebellum, and higher brain centers.",
      "Support brainstem reflex arcs and cranial nerve pathways."
    ],
    "connections": [
      "Includes ascending sensory tracts and descending corticospinal and corticonuclear fibers.",
      "Links brainstem nuclei with cerebellum via cerebellar peduncles."
    ]
  },
  "65": {
    "name": "Olfactory Tract",
    "keywords": [
      "Olfactory System",
      "Smell"
    ],
    "groups": [
      "Olfactory System"
    ],
    "description": "Bundle of olfactory bulb axons transmitting odor information to olfactory cortex and limbic structures.",
    "aliases": [
      "Lateral Olfactory Tract"
    ],
    "functions": [
      "Conveys processed olfactory signals for conscious perception and emotional associations.",
      "Supports odor-guided behaviors through projections to limbic areas."
    ],
    "connections": [
      "Originates from mitral and tufted cells of the olfactory bulb.",
      "Projects to piriform cortex, olfactory tubercle, amygdala, and entorhinal cortex."
    ]
  },
  "66": {
    "name": "Precentral Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Primary motor cortex gyrus containing the somatotopic map for voluntary movements.",
    "aliases": [
      "Primary Motor Cortex",
      "M1"
    ],
    "functions": [
      "Generates corticospinal commands for skilled limb and facial movements.",
      "Encodes force and direction parameters of motor output."
    ],
    "connections": [
      "Receives input from premotor, supplementary motor, and somatosensory cortices.",
      "Projects via corticospinal and corticobulbar tracts to spinal and brainstem motor nuclei."
    ]
  },
  "67": {
    "name": "Superior Frontal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Dorsal frontal lobe gyrus involved in executive control, working memory, and self-referential processing.",
    "aliases": [
      "Superior Frontal Cortex"
    ],
    "functions": [
      "Supports planning, attention shifting, and motor imagery.",
      "Contributes to default mode network activity related to introspection."
    ],
    "connections": [
      "Interconnects with dorsolateral prefrontal, parietal, and cingulate cortices.",
      "Projects to caudate nucleus and thalamic mediodorsal nucleus."
    ]
  },
  "68": {
    "name": "Middle Frontal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Dorsolateral Prefrontal Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Central frontal gyrus mediating executive functions, language, and eye movement planning.",
    "aliases": [
      "Middle Frontal Cortex"
    ],
    "functions": [
      "Facilitates working memory, attentional control, and reasoning.",
      "Supports language production via dorsolateral prefrontal circuits."
    ],
    "connections": [
      "Receives multimodal input from parietal association areas and thalamus.",
      "Projects to caudate nucleus, premotor cortex, and inferior frontal regions."
    ]
  },
  "69": {
    "name": "Triangular Inferior Frontal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Frontal language region involved in expressive and semantic aspects of speech.",
    "aliases": [
      "Pars triangularis",
      "Part of Broca's area"
    ],
    "functions": [
      "Supports semantic selection and controlled language production.",
      "Contributes to syntactic processing during speech planning."
    ],
    "connections": [
      "Interacts with the superior temporal gyrus via the arcuate fasciculus.",
      "Connects with dorsolateral prefrontal and supplementary motor areas."
    ]
  },
  "70": {
    "name": "Opercular Inferior Frontal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Inferior frontal opercular subdivision implicated in language articulation and sensorimotor integration.",
    "aliases": [
      "Opercular Part of Inferior Frontal Gyrus",
      "Broca's Pars Opercularis"
    ],
    "functions": [
      "Coordinates speech production and phonological processing.",
      "Integrates orofacial motor commands with auditory feedback."
    ],
    "connections": [
      "Receives input from superior temporal auditory areas and premotor cortex.",
      "Projects to motor cortex, basal ganglia, and supplementary motor area."
    ]
  },
  "71": {
    "name": "Gyrus Rectus (Straight Gyrus)",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Medial orbital gyrus anterior to olfactory sulcus involved in reward valuation and autonomic control.",
    "aliases": [
      "Straight Gyrus",
      "Gyrus Rectus"
    ],
    "functions": [
      "Evaluates reward contingencies and social cues.",
      "Regulates autonomic responses tied to emotion."
    ],
    "connections": [
      "Connected with orbitofrontal cortex, amygdala, and hypothalamus.",
      "Receives olfactory input via anterior olfactory nucleus and piriform cortex."
    ]
  },
  "72": {
    "name": "Medial Orbital Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Medial orbital surface gyrus integrating reward, emotion, and visceral information.",
    "aliases": [
      "Medial Orbital Cortex"
    ],
    "functions": [
      "Participates in valuation-based decision making.",
      "Modulates autonomic responses and affective states."
    ],
    "connections": [
      "Interconnects with ventromedial prefrontal cortex, amygdala, and hippocampus.",
      "Projects to hypothalamus and ventral striatum."
    ]
  },
  "73": {
    "name": "Anterior Intermediate Orbital Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Anterior orbital gyrus bridging medial and lateral orbital surfaces for social-emotional appraisal.",
    "aliases": [
      "Anterior Orbital Gyrus"
    ],
    "functions": [
      "Assesses reward expectations and emotional significance of stimuli.",
      "Supports adaptive decision making in complex social contexts."
    ],
    "connections": [
      "Receives input from amygdala, temporal pole, and sensory association cortices.",
      "Projects to ventromedial prefrontal and striatal circuits."
    ]
  },
  "74": {
    "name": "Posterior Intermediate Orbital Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Posterior intermediate orbital gyrus contributing to taste, olfaction, and reward-guided behavior.",
    "aliases": [
      "Posterior Orbital Gyrus"
    ],
    "functions": [
      "Integrates gustatory and olfactory cues with reward value.",
      "Participates in reversal learning and adaptive control."
    ],
    "connections": [
      "Connected with insular cortex, gustatory thalamus, and amygdala.",
      "Projects to ventral striatum and medial prefrontal cortex."
    ]
  },
  "75": {
    "name": "Lateral Orbital Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Lateral orbital gyrus interfacing sensory association inputs with reward-based decision circuits.",
    "aliases": [
      "Lateral Orbitofrontal Cortex"
    ],
    "functions": [
      "Supports evaluation of punishers and behavioral change.",
      "Integrates multisensory evidence for value-based choices."
    ],
    "connections": [
      "Receives projections from temporal association cortex, amygdala, and sensory cortices.",
      "Projects to dorsolateral prefrontal cortex, striatum, and hypothalamus."
    ]
  },
  "76": {
    "name": "Rostral Paracentral Lobule",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Medial frontal lobule housing supplementary motor areas for leg and trunk representation.",
    "aliases": [
      "Anterior Paracentral Lobule"
    ],
    "functions": [
      "Initiates internally driven movements and bimanual coordination.",
      "Participates in motor planning for locomotion."
    ],
    "connections": [
      "Receives inputs from premotor cortex, basal ganglia, and cerebellum.",
      "Projects to corticospinal tract targeting lower limb motor neurons."
    ]
  },
  "77": {
    "name": "Frontal Operculum",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Portion of inferior frontal cortex forming operculum over insula, central to gustatory and language functions.",
    "aliases": [
      "Frontal Opercular Cortex"
    ],
    "functions": [
      "Processes taste perception and orofacial somatosensation.",
      "Contributes to articulation planning and phonological working memory."
    ],
    "connections": [
      "Receives gustatory thalamic input and insular projections.",
      "Projects to motor cortex, ventral striatum, and anterior insula."
    ]
  },
  "78": {
    "name": "Postcentral Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Primary somatosensory cortex gyrus encoding tactile and proprioceptive information.",
    "aliases": [
      "Postcentral Cortex",
      "S1"
    ],
    "functions": [
      "Maps somatotopic sensory input for conscious perception of touch, vibration, and proprioception.",
      "Supports sensorimotor integration for fine motor control."
    ],
    "connections": [
      "Receives thalamic input from VPL and VPM nuclei.",
      "Projects to secondary somatosensory cortex, posterior parietal cortex, and motor areas."
    ]
  },
  "79": {
    "name": "Supraparietal Lobule",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Dorsal parietal lobule involved in visuomotor coordination, spatial attention, and reaching.",
    "aliases": [
      "Superior Parietal Lobule"
    ],
    "functions": [
      "Integrates somatosensory and visual information for spatial representation.",
      "Guides hand-eye coordination and body awareness."
    ],
    "connections": [
      "Interconnects with premotor cortex, superior occipital cortex, and cerebellum.",
      "Projects to intraparietal sulcus regions and dorsolateral prefrontal cortex."
    ]
  },
  "80": {
    "name": "Supramarginal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Inferior parietal gyrus supporting language, empathy, and multimodal integration.",
    "aliases": [
      "Supramarginal Cortex"
    ],
    "functions": [
      "Facilitates phonological processing and verbal working memory.",
      "Contributes to theory of mind and body schema."
    ],
    "connections": [
      "Receives inputs from auditory cortex, somatosensory cortex, and visual association areas.",
      "Projects to inferior frontal gyrus, premotor cortex, and temporoparietal junction."
    ]
  },
  "81": {
    "name": "Angular Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Posterior inferior parietal gyrus integrating visual, auditory, and somatosensory cues for language and spatial cognition.",
    "aliases": [
      "Angular Cortex"
    ],
    "functions": [
      "Supports semantic processing, reading, and number cognition.",
      "Mediates attention reorienting and spatial awareness."
    ],
    "connections": [
      "Interconnects with temporal association cortex, prefrontal regions, and hippocampal formation.",
      "Projects to default mode network hubs and language networks."
    ]
  },
  "82": {
    "name": "Precuneus",
    "keywords": [
      "Cerebral Cortex",
      "Medial Parietal Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Medial parietal cortex involved in visuospatial imagery, self-referential thought, and memory retrieval.",
    "aliases": [
      "Precuneal Cortex"
    ],
    "functions": [
      "Supports episodic memory and scene construction.",
      "Participates in default mode network and conscious awareness."
    ],
    "connections": [
      "Receives input from posterior cingulate, parietal, and occipital cortices.",
      "Projects to medial prefrontal cortex, hippocampus, and thalamus."
    ]
  },
  "83": {
    "name": "Caudal Paracentral Lobule",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Posterior continuation of paracentral lobule containing somatotopic representation of lower limbs in somatosensory cortex.",
    "aliases": [
      "Posterior Paracentral Lobule"
    ],
    "functions": [
      "Processes sensory feedback from legs and pelvic region.",
      "Contributes to proprioceptive control of gait."
    ],
    "connections": [
      "Receives thalamic VPL input for lower limb sensory modalities.",
      "Projects to supplementary motor and premotor areas for locomotor control."
    ]
  },
  "84": {
    "name": "Superior Temporal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Dorsal temporal gyrus specialized for auditory processing and language comprehension.",
    "aliases": [
      "Superior Temporal Cortex"
    ],
    "functions": [
      "Processes primary auditory information including pitch and speech perception.",
      "Supports social cognition via superior temporal sulcus regions."
    ],
    "connections": [
      "Receives input from medial geniculate nucleus and auditory brainstem pathways.",
      "Projects to inferior frontal gyrus, parietal association cortex, and limbic areas."
    ]
  },
  "85": {
    "name": "Middle Temporal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Lateral Temporal Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Middle temporal gyrus involved in semantic memory, language comprehension, and motion perception.",
    "aliases": [
      "Middle Temporal Cortex"
    ],
    "functions": [
      "Supports lexical retrieval and conceptual knowledge.",
      "Participates in processing visual motion and biological movement."
    ],
    "connections": [
      "Interconnects with inferior frontal language areas, angular gyrus, and temporal pole.",
      "Projects to ventral visual stream and limbic cortices."
    ]
  },
  "86": {
    "name": "Inferior Temporal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Inferior temporal gyrus forming part of ventral visual stream for object recognition.",
    "aliases": [
      "Inferior Temporal Cortex"
    ],
    "functions": [
      "Encodes complex visual features for object and face recognition.",
      "Supports semantic categorization and memory recall."
    ],
    "connections": [
      "Receives input from occipital visual areas and superior temporal sulcus.",
      "Projects to perirhinal cortex, amygdala, and prefrontal cortex."
    ]
  },
  "87": {
    "name": "Temporal Fusiform Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Fusiform Gyrus",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Ventral temporal gyrus specialized for high-level visual processing including face and word recognition.",
    "aliases": [
      "Fusiform Gyrus",
      "Occipitotemporal Gyrus"
    ],
    "functions": [
      "Supports fusiform face area and visual word form area for expert pattern recognition.",
      "Integrates visual identity cues with memory and emotion."
    ],
    "connections": [
      "Receives input from ventral visual stream and occipital cortex.",
      "Projects to inferior temporal, parahippocampal, and prefrontal areas."
    ]
  },
  "88": {
    "name": "Transverse Temporal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Heschl’s Gyrus",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Heschl's gyrus forming primary auditory cortex receiving tonotopic thalamic input.",
    "aliases": [
      "Heschl's Gyrus",
      "Primary Auditory Cortex",
      "A1"
    ],
    "functions": [
      "Processes fundamental acoustic features such as frequency, intensity, and timing.",
      "Initiates cortical analysis for speech and music perception."
    ],
    "connections": [
      "Receives thalamocortical projections from medial geniculate nucleus.",
      "Projects to surrounding auditory association cortices and insula."
    ]
  },
  "89": {
    "name": "Planum Temporale",
    "keywords": [
      "Cerebral Cortex",
      "Planum Temporale of Heschl",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Planum posterior to Heschl's gyrus involved in auditory spatial processing and language lateralization.",
    "aliases": [
      "Temporoparietal Planum"
    ],
    "functions": [
      "Supports integration of auditory spatial cues and speech perception.",
      "Contributes to phonological working memory and language dominance."
    ],
    "connections": [
      "Interacts with superior temporal gyrus, inferior parietal lobule, and frontal operculum.",
      "Receives projections from auditory association cortex and medial geniculate body."
    ]
  },
  "90": {
    "name": "Temporal Pole",
    "keywords": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Anterior temporal lobe apex integrating multimodal sensory and limbic inputs for social and semantic processing.",
    "aliases": [
      "Temporal Pole Cortex"
    ],
    "functions": [
      "Mediates social-emotional cognition and autobiographical memory.",
      "Supports semantic representations of people and objects."
    ],
    "connections": [
      "Receives afferents from amygdala, orbitofrontal cortex, and sensory association cortices.",
      "Projects to limbic structures, insula, and prefrontal cortex."
    ]
  },
  "91": {
    "name": "Planum Polare",
    "keywords": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Anterior superior temporal plane region processing complex auditory patterns and prosody.",
    "aliases": [
      "Planum Polare"
    ],
    "functions": [
      "Analyzes spectral aspects of speech and music.",
      "Participates in auditory attention and predictive coding."
    ],
    "connections": [
      "Receives input from primary auditory cortex and medial geniculate nucleus.",
      "Projects to superior temporal gyrus, inferior frontal cortex, and insula."
    ]
  },
  "92": {
    "name": "Occipital Pole",
    "keywords": [
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Posterior-most occipital lobe region containing primary visual cortex representations.",
    "aliases": [
      "Occipital Apex"
    ],
    "functions": [
      "Supports high-acuity vision and processing of central visual field.",
      "Integrates binocular input for depth perception."
    ],
    "connections": [
      "Receives afferents via optic radiations from lateral geniculate nucleus.",
      "Projects to surrounding visual association cortices and splenial callosal fibers."
    ]
  },
  "93": {
    "name": "Cuneus",
    "keywords": [
      "Medial Occipital Cortex",
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Medial occipital gyrus forming part of primary visual cortex and dorsal visual stream.",
    "aliases": [
      "Cuneal Cortex"
    ],
    "functions": [
      "Processes lower visual field information and motion cues.",
      "Supports visuospatial attention via dorsal stream pathways."
    ],
    "connections": [
      "Receives input from lateral geniculate nucleus via optic radiations.",
      "Projects to superior parietal lobule and other occipital areas."
    ]
  },
  "94": {
    "name": "Lingual Gyrus",
    "keywords": [
      "Lingual Cortex",
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Medial occipitotemporal gyrus critical for visual memory and recognition of complex scenes.",
    "aliases": [
      "Lingual Cortex"
    ],
    "functions": [
      "Participates in encoding of letters, words, and visual imagery.",
      "Supports processing of visual scenes and dream imagery."
    ],
    "connections": [
      "Interconnects with calcarine cortex, parahippocampal gyrus, and fusiform gyrus.",
      "Projects to hippocampus and cingulate cortex via posterior cingulum."
    ]
  },
  "95": {
    "name": "Occipital Fusiform Gyrus",
    "keywords": [
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Ventral occipital gyrus serving as part of the ventral visual stream for object and face processing.",
    "aliases": [
      "Occipitotemporal Fusiform Gyrus"
    ],
    "functions": [
      "Integrates shape, color, and texture information for recognition.",
      "Supports reading and orthographic processing."
    ],
    "connections": [
      "Receives projections from calcarine cortex and lateral occipital complex.",
      "Projects to inferior temporal cortex and limbic structures."
    ]
  },
  "96": {
    "name": "Inferior Occipital Gyrus",
    "keywords": [
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Inferolateral occipital gyrus contributing to visual motion and object recognition pathways.",
    "aliases": [
      "Inferior Occipital Cortex"
    ],
    "functions": [
      "Participates in processing complex object shapes and motion cues.",
      "Supports integration of visual and spatial information for perception."
    ],
    "connections": [
      "Receives input from primary visual cortex and lateral occipital areas.",
      "Projects to temporal visual association cortices and parietal regions."
    ]
  },
  "97": {
    "name": "Superior Occipital Gyrus",
    "keywords": [
      "Occipital Lobe",
      "Visual Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Occipital Lobe"
    ],
    "description": "Dorsal occipital region that participates in spatial and motion aspects of vision.",
    "aliases": [
      "Superior occipital cortex"
    ],
    "functions": [
      "Processes visuospatial information for the dorsal visual stream.",
      "Integrates motion cues with parietal attention networks."
    ],
    "connections": [
      "Links to parietal cortices through the dorsal visual pathway.",
      "Interconnects with middle occipital gyrus and intraparietal sulcus."
    ]
  },
  "98": {
    "name": "Anterior Cingulate Gyrus",
    "keywords": [
      "Cingulate Cortex",
      "Limbic System",
      "Pregenual Cingulate"
    ],
    "groups": [
      "Cerebral Cortex",
      "Limbic System"
    ],
    "description": "Medial frontal gyrus implicated in cognitive control, emotion regulation, and autonomic integration.",
    "aliases": [
      "Rostral Cingulate Cortex",
      "ACC"
    ],
    "functions": [
      "Monitors conflict and error to adjust behavior.",
      "Integrates emotion and motivation with decision making."
    ],
    "connections": [
      "Receives input from prefrontal cortex, amygdala, and thalamus.",
      "Projects to premotor cortex, autonomic brainstem nuclei, and limbic structures."
    ]
  },
  "99": {
    "name": "Posterior Cingulate Gyrus",
    "keywords": [
      "Cingulate Cortex",
      "Limbic System",
      "Retrosplenial Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Limbic System"
    ],
    "description": "Posterior cingulate gyrus serving as a default mode network hub for memory and self-processing.",
    "aliases": [
      "PCC"
    ],
    "functions": [
      "Supports episodic memory retrieval and spatial orientation.",
      "Integrates internal mentation with environmental awareness."
    ],
    "connections": [
      "Interconnects with precuneus, medial temporal lobe, and medial prefrontal cortex.",
      "Receives thalamic inputs from anterior nuclei and projects via cingulum bundle."
    ]
  },
  "100": {
    "name": "Cingulo-Parahippocampal Isthmus",
    "keywords": [
      "Cingulate Cortex",
      "Isthmus Cingulate",
      "Limbic System"
    ],
    "groups": [
      "Cerebral Cortex",
      "Limbic System"
    ],
    "description": "Narrow bridge linking cingulate and parahippocampal gyri carrying fibers of the cingulum bundle.",
    "aliases": [
      "Isthmus of Cingulate Gyrus"
    ],
    "functions": [
      "Integrates retrosplenial and parahippocampal processing for memory and navigation.",
      "Supports limbic connectivity between posterior cingulate and hippocampal formation."
    ],
    "connections": [
      "Contains cingulum fibers connecting posterior cingulate to parahippocampal regions.",
      "Links retrosplenial cortex with hippocampus and entorhinal cortex."
    ]
  },
  "101": {
    "name": "Subcallosal (Parolfactory) Gyrus",
    "keywords": [
      "Cingulate Cortex",
      "Limbic System",
      "Parolfactory Area",
      "Subcallosal Area"
    ],
    "groups": [
      "Cerebral Cortex",
      "Limbic System"
    ],
    "description": "Small medial frontal gyrus adjacent to corpus callosum involved in reward, olfaction, and limbic processing.",
    "aliases": [
      "Subcallosal Gyrus",
      "Parolfactory Area"
    ],
    "functions": [
      "Regulates mood and autonomic responses via limbic circuits.",
      "Participates in olfactory-driven emotional processing."
    ],
    "connections": [
      "Receives inputs from orbitofrontal cortex, amygdala, and olfactory structures.",
      "Projects to hypothalamus, ventral striatum, and cingulate cortex."
    ]
  },
  "102": {
    "name": "Anterior Parahippocampal Gyrus",
    "keywords": [
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Anterior segment of parahippocampal gyrus associated with entorhinal cortex and olfactory-limbic integration.",
    "aliases": [
      "Anterior Parahippocampal Cortex"
    ],
    "functions": [
      "Supports encoding of contextual and episodic memories.",
      "Integrates olfactory inputs with hippocampal memory circuits."
    ],
    "connections": [
      "Receives input from entorhinal, perirhinal, and olfactory cortices.",
      "Projects to hippocampal formation, amygdala, and orbitofrontal cortex."
    ]
  },
  "103": {
    "name": "Posterior Parahippocampal Gyrus",
    "keywords": [
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Posterior parahippocampal gyrus encompassing parahippocampal place area for scene perception.",
    "aliases": [
      "Posterior Parahippocampal Cortex"
    ],
    "functions": [
      "Processes spatial layouts and environmental scenes.",
      "Supports memory for locations and contextual associations."
    ],
    "connections": [
      "Receives input from retrosplenial cortex, occipital visual areas, and hippocampus.",
      "Projects to entorhinal cortex, cingulate gyrus, and medial temporal lobe."
    ]
  },
  "104": {
    "name": "Ambiens Gyrus",
    "keywords": [
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Medial temporal gyrus adjacent to hippocampus contributing to olfactory and memory integration.",
    "aliases": [
      "Gyrus Ambiens",
      "Uncal Cortex"
    ],
    "functions": [
      "Supports odor-based memory and emotional responses.",
      "Links olfactory information with hippocampal encoding."
    ],
    "connections": [
      "Receives input from olfactory cortex and amygdala.",
      "Projects to entorhinal cortex, hippocampus, and hypothalamus."
    ]
  },
  "105": {
    "name": "Head of Hippocampus",
    "keywords": [
      "Hippocampal Head",
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Anterior hippocampal segment involved in emotional memory and stress regulation.",
    "aliases": [
      "Hippocampal Head",
      "Pes Hippocampi"
    ],
    "functions": [
      "Encodes episodic memories with strong affective components.",
      "Participates in hypothalamic-pituitary-adrenal axis modulation."
    ],
    "connections": [
      "Receives entorhinal and amygdalar inputs via perforant pathway.",
      "Projects to fornix, septal nuclei, and hypothalamus."
    ]
  },
  "106": {
    "name": "Body of Hippocampus",
    "keywords": [
      "Hippocampal Body",
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Middle hippocampal portion supporting pattern separation and consolidation of episodic memories.",
    "aliases": [
      "Hippocampal Body"
    ],
    "functions": [
      "Supports spatial navigation and associative memory.",
      "Mediates communication between anterior and posterior hippocampal segments."
    ],
    "connections": [
      "Receives perforant pathway input from entorhinal cortex and septal modulation.",
      "Projects along longitudinal fibers to fornix and subiculum."
    ]
  },
  "107": {
    "name": "Tail of Hippocampus",
    "keywords": [
      "Hippocampal Tail",
      "Hippocampus",
      "Memory"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation"
    ],
    "description": "Posterior hippocampal segment specialized for spatial memory and navigation.",
    "aliases": [
      "Hippocampal Tail"
    ],
    "functions": [
      "Supports precise spatial mapping and scene discrimination.",
      "Contributes to memory retrieval and navigation planning."
    ],
    "connections": [
      "Receives input from retrosplenial cortex and entorhinal posterior regions.",
      "Projects via fornix and subiculum to thalamus and mammillary bodies."
    ]
  },
  "108": {
    "name": "Long Insular Gyri",
    "keywords": [
      "Insula",
      "Insular Cortex",
      "Posterior Insula"
    ],
    "groups": [
      "Cerebral Cortex",
      "Insular Cortex"
    ],
    "description": "Long gyri on insular surface processing visceral sensation and interoceptive awareness.",
    "aliases": [
      "Posterior Insular Gyri"
    ],
    "functions": [
      "Encode pain, temperature, and vestibular signals.",
      "Support integration of bodily states with emotional awareness."
    ],
    "connections": [
      "Receive inputs from thalamic ventromedial posterior nucleus and somatosensory cortices.",
      "Project to anterior insula, cingulate cortex, and prefrontal regions."
    ]
  },
  "109": {
    "name": "Short Insular Gyri",
    "keywords": [
      "Anterior Insula",
      "Insula",
      "Insular Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Insular Cortex"
    ],
    "description": "Short anterior insular gyri responsible for higher-order interoception, emotion, and gustation.",
    "aliases": [
      "Anterior Insular Gyri"
    ],
    "functions": [
      "Facilitate awareness of emotions and bodily feelings.",
      "Participate in taste processing and autonomic control."
    ],
    "connections": [
      "Receive input from thalamic gustatory nuclei, amygdala, and frontal operculum.",
      "Project to anterior cingulate cortex, orbitofrontal cortex, and limbic structures."
    ]
  },
  "110": {
    "name": "Limen Insula",
    "keywords": [
      "Insula",
      "Insular Apex",
      "Insular Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Insular Cortex"
    ],
    "description": "Transition zone between insula and temporal lobe that relays olfactory and gustatory signals.",
    "aliases": [
      "Threshold of Insula",
      "Insular Limen"
    ],
    "functions": [
      "Integrates chemosensory inputs before distribution to insular and orbitofrontal cortices.",
      "Coordinates visceral-autonomic responses to taste and smell."
    ],
    "connections": [
      "Receives fibers from olfactory tract and gustatory thalamus.",
      "Projects to anterior insula, amygdala, and frontal operculum."
    ]
  },
  "111": {
    "name": "Pretectal Region",
    "keywords": [
      "Mesencephalon",
      "Midbrain",
      "Pretectal Area"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Dorsal midbrain region mediating pupillary reflexes and visual attention shifts.",
    "aliases": [
      "Pretectum"
    ],
    "functions": [
      "Controls pupillary light reflex and accommodation.",
      "Contributes to visuomotor coordination for eye movements."
    ],
    "connections": [
      "Receives retinal and superior colliculus inputs via optic tract.",
      "Projects to Edinger-Westphal nucleus, superior colliculus, and pulvinar."
    ]
  },
  "112": {
    "name": "Midbrain Tegmentum",
    "keywords": [
      "Mesencephalon",
      "Midbrain",
      "Midbrain Tegmental Area"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Central midbrain region containing ascending arousal systems and cranial nerve nuclei.",
    "aliases": [
      "Midbrain Tegmental Area"
    ],
    "functions": [
      "Maintains arousal and reward processing via dopaminergic and cholinergic neurons.",
      "Integrates sensory information for orienting and reflexive responses."
    ],
    "connections": [
      "Receives inputs from cerebral cortex, cerebellum, and spinal cord.",
      "Projects to thalamus, basal ganglia, hypothalamus, and spinal cord."
    ]
  },
  "113": {
    "name": "Red Nucleus",
    "keywords": [
      "Mesencephalon",
      "Midbrain",
      "Rubral Region"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Paired midbrain nucleus coordinating motor learning and limb movement timing.",
    "aliases": [
      "Nucleus Ruber",
      "Red Nucleus"
    ],
    "functions": [
      "Facilitates limb flexor control and motor learning.",
      "Relays cerebellar output to spinal and cortical motor systems."
    ],
    "connections": [
      "Receives cerebellar dentate nucleus projections via superior cerebellar peduncle.",
      "Projects to spinal cord via rubrospinal tract and to thalamus."
    ]
  },
  "114": {
    "name": "Substantia Nigra",
    "keywords": [
      "Mesencephalon",
      "Midbrain",
      "Pars Reticulata",
      "Substantia Nigra Pars Compacta"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Basal midbrain structure with dopaminergic and GABAergic subdivisions crucial for movement and reward.",
    "aliases": [
      "Substantia Nigra Pars Compacta",
      "Substantia Nigra Pars Reticulata"
    ],
    "functions": [
      "Regulates motor initiation through dopamine release to striatum.",
      "Provides inhibitory output to thalamus and superior colliculus for eye movement control."
    ],
    "connections": [
      "Receives afferents from striatum and subthalamic nucleus.",
      "Projects dopaminergic fibers to striatum and inhibitory projections to thalamus and brainstem."
    ]
  },
  "115": {
    "name": "Superior Colliculus",
    "keywords": [
      "Mesencephalon",
      "Midbrain",
      "Superior Tectum"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Layered midbrain tectal structure integrating visual signals for orienting movements.",
    "aliases": [
      "Superior Colliculus"
    ],
    "functions": [
      "Coordinates saccadic eye movements and head orientation.",
      "Integrates multimodal sensory cues for spatial attention."
    ],
    "connections": [
      "Receives retinal, cortical, and auditory inputs.",
      "Projects to brainstem gaze centers, thalamus, and spinal cord."
    ]
  },
  "116": {
    "name": "Inferior Colliculus",
    "keywords": [
      "Inferior Tectum",
      "Mesencephalon",
      "Midbrain"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Midbrain auditory tectal structure processing sound localization and reflexes.",
    "aliases": [
      "Inferior Colliculus"
    ],
    "functions": [
      "Integrates auditory signals from brainstem nuclei for spatial hearing.",
      "Drives acoustic startle and orienting reflexes."
    ],
    "connections": [
      "Receives inputs from cochlear nucleus, superior olivary complex, and lateral lemniscus.",
      "Projects to medial geniculate nucleus and auditory cortex."
    ]
  },
  "117": {
    "name": "Cerebral Peduncle (Crus Cerebri)",
    "keywords": [
      "Cerebral Crus",
      "Mesencephalon",
      "Midbrain"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Massive descending fiber bundle conveying cortical motor signals through the midbrain.",
    "aliases": [
      "Crus Cerebri",
      "Cerebral Peduncle"
    ],
    "functions": [
      "Transmits corticospinal, corticobulbar, and corticopontine fibers.",
      "Supports voluntary movement control and cerebellar feedback loops."
    ],
    "connections": [
      "Receives axons from frontal, parietal, and temporal cortices.",
      "Projects to brainstem motor nuclei, pontine nuclei, and spinal cord."
    ]
  },
  "118": {
    "name": "Superior Cerebellar Peduncle",
    "keywords": [
      "Brachium Conjunctivum",
      "Cerebellar Connection",
      "Cerebellum",
      "Hindbrain",
      "Midbrain"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum",
      "Brainstem",
      "Midbrain"
    ],
    "description": "Major efferent pathway from cerebellum carrying processed motor signals to brainstem and thalamus.",
    "aliases": [
      "Superior Cerebellar Peduncle"
    ],
    "functions": [
      "Channels cerebellar output for motor coordination and eye movements.",
      "Participates in cognitive loops linking cerebellum to frontal cortex."
    ],
    "connections": [
      "Receives input from dentate, interposed, and fastigial nuclei.",
      "Projects to red nucleus, thalamus, and vestibular nuclei."
    ]
  },
  "119": {
    "name": "Cerebral Aqueduct",
    "keywords": [
      "Aqueduct of Sylvius",
      "Mesencephalon",
      "Midbrain",
      "Sylvian Aqueduct"
    ],
    "groups": [
      "Brainstem",
      "Midbrain"
    ],
    "description": "Narrow canal linking third and fourth ventricles through the midbrain.",
    "aliases": [
      "Aqueduct of Sylvius",
      "Cerebral Aqueduct"
    ],
    "functions": [
      "Allows cerebrospinal fluid flow from forebrain to hindbrain.",
      "Helps distribute neuroendocrine signals within ventricular system."
    ],
    "connections": [
      "Connects third ventricle superiorly with fourth ventricle inferiorly.",
      "Borders periaqueductal gray, facilitating diffusion of neuromodulators."
    ]
  },
  "120": {
    "name": "Paravermis of Cerebellum",
    "keywords": [
      "Cerebellum",
      "Hindbrain",
      "Intermediate Cerebellum"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Intermediate cerebellar zone between vermis and hemispheres coordinating limb and trunk movements.",
    "aliases": [
      "Intermediate Cerebellar Cortex",
      "Paravermis"
    ],
    "functions": [
      "Adjusts ongoing limb movements and posture via spinocerebellar feedback.",
      "Contributes to motor learning for reaching and grasping."
    ],
    "connections": [
      "Receives spinocerebellar and pontocerebellar inputs.",
      "Projects to interposed nuclei and onward to red nucleus and motor cortex."
    ]
  },
  "121": {
    "name": "Lateral Hemisphere of Cerebellum",
    "keywords": [
      "Cerebellar Hemisphere",
      "Cerebellum",
      "Hindbrain"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Lateral cerebellar hemispheres involved in planning complex movements and cognitive processing.",
    "aliases": [
      "Cerebrocerebellum",
      "Lateral Cerebellar Cortex"
    ],
    "functions": [
      "Support motor planning, timing, and error correction.",
      "Participate in language, working memory, and executive functions."
    ],
    "connections": [
      "Receive extensive pontocerebellar input from cerebral cortex.",
      "Project via dentate nucleus to thalamus and prefrontal/motor areas."
    ]
  },
  "122": {
    "name": "Basilar Part of Pons",
    "keywords": [
      "Brainstem",
      "Pons"
    ],
    "groups": [
      "Brainstem",
      "Pons"
    ],
    "description": "Basilar pons containing pontine nuclei and transverse fibers."
  },
  "123": {
    "name": "Pontine Tegmentum",
    "keywords": [
      "Brainstem",
      "Pons"
    ],
    "groups": [
      "Brainstem",
      "Pons"
    ],
    "description": "Pontine tegmental core with cranial nerve nuclei."
  },
  "124": {
    "name": "Pyramidal Part of Medulla Oblongata",
    "keywords": [
      "Brainstem",
      "Medulla",
      "Medullary Pyramid"
    ],
    "groups": [
      "Brainstem",
      "Medulla"
    ],
    "description": "Anterior medullary pyramid containing corticospinal fibers descending to spinal cord.",
    "aliases": [
      "Pyramids of Medulla"
    ],
    "functions": [
      "Convey voluntary motor commands from motor cortex to spinal motor neurons.",
      "Participate in decussation controlling contralateral limb movements."
    ],
    "connections": [
      "Receive corticospinal axons from cerebral cortex.",
      "Project to spinal cord anterior horn cells after pyramidal decussation."
    ]
  },
  "125": {
    "name": "Tegmentum of Medulla Oblongata",
    "keywords": [
      "Brainstem",
      "Medulla",
      "Medullary Tegmentum"
    ],
    "groups": [
      "Brainstem",
      "Medulla"
    ],
    "description": "Medullary tegmentum housing autonomic nuclei, reticular formation, and cranial nerve centers.",
    "aliases": [
      "Medullary Tegmentum"
    ],
    "functions": [
      "Regulates cardiovascular, respiratory, and reflex functions.",
      "Integrates sensory input for arousal and motor coordination."
    ],
    "connections": [
      "Receives inputs from spinal cord, cerebellum, and cranial nerves.",
      "Projects to hypothalamus, thalamus, and spinal cord."
    ]
  },
  "126": {
    "name": "Inferior Olive",
    "keywords": [
      "Brainstem",
      "Inferior Olivary Complex",
      "Medulla"
    ],
    "groups": [
      "Brainstem",
      "Medulla"
    ],
    "description": "Medullary olivary complex providing climbing fiber input to cerebellum for motor learning.",
    "aliases": [
      "Inferior Olivary Nucleus"
    ],
    "functions": [
      "Generates error signals that guide cerebellar plasticity.",
      "Synchronizes motor timing and coordination."
    ],
    "connections": [
      "Receives input from cortex, spinal cord, and red nucleus.",
      "Projects climbing fibers to contralateral cerebellar cortex."
    ]
  },
  "127": {
    "name": "Inferior Cerebellar Peduncle",
    "keywords": [
      "Cerebellum",
      "Hindbrain"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Large fiber bundle carrying afferent inputs from spinal cord and medulla to cerebellum.",
    "aliases": [
      "Restiform Body",
      "Inferior Cerebellar Peduncle"
    ],
    "functions": [
      "Transmits proprioceptive and vestibular information to cerebellum.",
      "Supports balance and posture adjustments."
    ],
    "connections": [
      "Receives dorsal spinocerebellar, vestibular, and olivocerebellar fibers.",
      "Projects to cerebellar cortex and deep nuclei."
    ]
  },
  "128": {
    "name": "Middle Cerebellar Peduncle",
    "keywords": [
      "Brachium Pontis",
      "Cerebellum",
      "Hindbrain"
    ],
    "groups": [
      "Hindbrain",
      "Cerebellum"
    ],
    "description": "Massive pontocerebellar pathway conveying cortical information into cerebellum.",
    "aliases": [
      "Brachium Pontis",
      "Middle Cerebellar Peduncle"
    ],
    "functions": [
      "Carries pontine nuclei efferents encoding cortical motor plans.",
      "Supports coordination of voluntary movements and cognitive timing."
    ],
    "connections": [
      "Receives pontocerebellar fibers originating from corticopontine inputs.",
      "Projects to lateral cerebellar hemispheres."
    ]
  },
  "129": {
    "name": "Fourth Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Ventricle",
      "Ventricular Cavity"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Diamond-shaped ventricular cavity within pons and medulla containing cerebrospinal fluid.",
    "aliases": [
      "Ventriculus Quartus",
      "Fourth Ventricle"
    ],
    "functions": [
      "Circulates CSF between cerebral aqueduct and central canal/subarachnoid space.",
      "Provides ependymal surface for neuroendocrine exchange."
    ],
    "connections": [
      "Receives CSF from cerebral aqueduct and lateral apertures.",
      "Drains into central canal and subarachnoid cisterns via foramina of Magendie and Luschka."
    ]
  },
  "130": {
    "name": "Central Canal of Medulla Oblongata",
    "keywords": [
      "Cerebrospinal Fluid",
      "Spinal Canal Continuation",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Continuation of ventricular system through medulla into spinal cord.",
    "aliases": [
      "Central Canal of Medulla"
    ],
    "functions": [
      "Conducts cerebrospinal fluid toward spinal cord.",
      "Supports diffusion of neuromodulators within medullary gray."
    ],
    "connections": [
      "Continuous rostrally with fourth ventricle.",
      "Extends caudally into spinal cord central canal."
    ]
  },
  "131": {
    "name": "Midline Nuclear Complex",
    "keywords": [
      "Brainstem",
      "Reticular Formation"
    ],
    "groups": [
      "Brainstem"
    ],
    "description": "Midline brainstem nuclei supporting arousal and visceral control."
  },
  "132": {
    "name": "Lateral Olfactory Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Olfactory cortical gyrus along medial frontal lobe receiving olfactory tract fibers.",
    "aliases": [
      "Medial Olfactory Gyrus",
      "Lateral Olfactory Stria Cortex"
    ],
    "functions": [
      "Participates in odor discrimination and associative olfactory learning.",
      "Links olfactory perception with emotion and memory."
    ],
    "connections": [
      "Receives lateral olfactory tract projections from olfactory bulb.",
      "Projects to piriform cortex, orbitofrontal cortex, and amygdala."
    ]
  },
  "133": {
    "name": "Parietal Operculum",
    "keywords": [
      "Cerebral Cortex",
      "Parietal Lobe",
      "Secondary Somatosensory Cortex"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe"
    ],
    "description": "Opercular parietal region overlying insula that contributes to somatosensory integration.",
    "aliases": [
      "Parietal Operculum"
    ],
    "functions": [
      "Processes secondary somatosensory information including pain and temperature.",
      "Integrates tactile input with gustatory and vestibular signals."
    ],
    "connections": [
      "Receives thalamic input from ventral posterior inferior and ventromedial nuclei.",
      "Projects to insula, inferior parietal lobule, and premotor cortex."
    ]
  },
  "134": {
    "name": "Posteroventral Putamen",
    "keywords": [
      "Basal Ganglia",
      "Posterior Putamen",
      "Striatum"
    ],
    "groups": [
      "Basal Ganglia"
    ],
    "description": "Ventral portion of putamen enriched in limbic and associative inputs.",
    "aliases": [
      "Ventral Putamen",
      "Posteroventral Putamen"
    ],
    "functions": [
      "Integrates reward-related and sensorimotor signals for habit formation.",
      "Supports action selection linked to motivational context."
    ],
    "connections": [
      "Receives inputs from orbitofrontal cortex, insula, and motor areas.",
      "Projects to globus pallidus externus and ventral pallidum."
    ]
  },
  "135": {
    "name": "Paracingulate Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Cingulate Cortex",
      "Limbic System",
      "Medial Prefrontal Cortex",
      "Parietal Lobe"
    ],
    "groups": [
      "Cerebral Cortex",
      "Parietal Lobe",
      "Limbic System"
    ],
    "description": "Medial frontal gyrus within cingulate sulcus involved in conflict monitoring and social cognition.",
    "aliases": [
      "Paracingulate Gyrus",
      "Dorsal Anterior Cingulate"
    ],
    "functions": [
      "Evaluates action outcomes and cognitive conflict.",
      "Supports mentalizing and self-awareness."
    ],
    "connections": [
      "Receives input from prefrontal cortex, limbic structures, and thalamus.",
      "Projects to supplementary motor area, striatum, and brainstem autonomic centers."
    ]
  },
  "136": {
    "name": "Rostral Gyrus",
    "keywords": [
      "Frontal Lobe",
      "Frontal Pole Region",
      "Medial Frontal"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Medial frontal pole gyrus bordering cingulate sulcus involved in high-level executive and social cognition.",
    "aliases": [
      "Rostral Gyrus",
      "Frontopolar Medial Gyrus"
    ],
    "functions": [
      "Supports prospective memory and strategic planning.",
      "Contributes to social inference and emotional regulation."
    ],
    "connections": [
      "Interconnects with ventromedial prefrontal cortex, dorsolateral prefrontal cortex, and anterior cingulate.",
      "Projects to caudate nucleus, thalamus, and limbic structures."
    ]
  },
  "137": {
    "name": "Frontomarginal Gyrus",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe",
      "Frontomarginal Sulcus Region"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Anterior-most lateral frontal gyrus integrating multisensory information for complex cognition.",
    "aliases": [
      "Frontomarginal Gyrus",
      "Brodmann Area 10"
    ],
    "functions": [
      "Supports abstract reasoning, multitasking, and metacognitive awareness.",
      "Participates in social and emotional evaluation."
    ],
    "connections": [
      "Receives input from temporal pole, parietal association areas, and limbic cortex.",
      "Projects to dorsolateral prefrontal cortex, orbitofrontal cortex, and caudate."
    ]
  },
  "138": {
    "name": "Frontal Pole",
    "keywords": [
      "Cerebral Cortex",
      "Frontal Lobe",
      "Rostral Frontal Pole"
    ],
    "groups": [
      "Cerebral Cortex",
      "Frontal Lobe"
    ],
    "description": "Extreme anterior tip of frontal lobe involved in prospective reasoning and self-generated goals.",
    "aliases": [
      "Frontal Pole",
      "Brodmann Area 10"
    ],
    "functions": [
      "Supports long-range planning, exploration, and default mode network processing.",
      "Integrates internal goals with social cognition."
    ],
    "connections": [
      "Interconnects with medial prefrontal, orbitofrontal, and temporal association cortices.",
      "Projects to dorsolateral prefrontal cortex, basal ganglia, and limbic circuits."
    ]
  },
  "139": {
    "name": "Perirhinal Gyrus",
    "keywords": [
      "Hippocampus",
      "Memory",
      "Memory Circuit",
      "Perirhinal Cortex",
      "Temporal Lobe"
    ],
    "groups": [
      "Limbic System",
      "Hippocampal Formation",
      "Cerebral Cortex",
      "Temporal Lobe"
    ],
    "description": "Medial temporal cortical region linking object recognition with memory consolidation.",
    "aliases": [
      "Perirhinal Cortex"
    ],
    "functions": [
      "Supports familiarity-based recognition memory and semantic associations.",
      "Integrates visual feature information for memory encoding."
    ],
    "connections": [
      "Receives input from inferior temporal visual areas and amygdala.",
      "Projects to entorhinal cortex, hippocampus, and orbitofrontal cortex."
    ]
  },
  "140": {
    "name": "Optic Radiation",
    "keywords": [
      "Forebrain",
      "Geniculocalcarine Tract",
      "Optic Radiation",
      "Visual Pathway",
      "White Matter"
    ],
    "groups": [
      "White Matter",
      "Forebrain",
      "Occipital Lobe"
    ],
    "description": "Fan-shaped fiber pathway carrying visual signals from thalamus to occipital cortex.",
    "aliases": [
      "Geniculocalcarine Tract",
      "Optic Radiations"
    ],
    "functions": [
      "Transmits retinotopic information necessary for conscious vision.",
      "Supports visual field processing including macular representation."
    ],
    "connections": [
      "Originates in lateral geniculate nucleus of the thalamus.",
      "Terminates in primary visual cortex along the calcarine fissure."
    ]
  },
  "141": {
    "name": "Atrium of Lateral Ventricle",
    "keywords": [
      "Cerebrospinal Fluid",
      "Trigone of Lateral Ventricle",
      "Ventricle"
    ],
    "groups": [
      "Ventricular System"
    ],
    "description": "Trigonal expansion of lateral ventricle where temporal and occipital horns converge.",
    "aliases": [
      "Ventricular Atrium",
      "Trigone of Lateral Ventricle"
    ],
    "functions": [
      "Serves as CSF reservoir adjacent to hippocampal tail and splenium.",
      "Provides anatomical reference for neurosurgical and imaging landmarks."
    ],
    "connections": [
      "Continuous with body, temporal horn, and occipital horn of lateral ventricle.",
      "Contains choroid plexus tuft connecting to temporal horn."
    ]
  }
}
